In [1]:
import pandas as pd
import pymysql

In [2]:
# Database connection
try:
    conn = pymysql.connect(
        host='localhost',
        user='newuser',
        passwd='password',
        db='sakila'
    )
    print('Connection established:\n', conn)
except (pymysql.err.OperationalError, pymysql.err.InternalError) as e:
    print("Ocurrió un error al conectar: ", e)

Connection established:
 <pymysql.connections.Connection object at 0x7f98af4e4250>

## Exercise 8-1

In [4]:
pd.read_sql_query(
    "SELECT count(*) num_rows FROM payment", 
    conn)

   num_rows
0     16049

## Exercise 8-2

In [9]:
pd.read_sql_query(
    "SELECT customer_id, count(*) num_payments, SUM(amount) total \
     FROM payment \
     GROUP BY customer_id", 
    conn)

     customer_id  num_payments   total
0              1            32  118.68
1              2            27  128.73
2              3            26  135.74
3              4            22   81.78
4              5            38  144.62
..           ...           ...     ...
594          595            30  117.70
595          596            28   96.72
596          597            25   99.75
597          598            22   83.78
598          599            19   83.81

[599 rows x 3 columns]

## Exercise 8-3

In [10]:
pd.read_sql_query(
    "SELECT customer_id, count(*) num_payments, SUM(amount) total \
     FROM payment \
     GROUP BY customer_id \
     HAVING count(*) >= 40", 
    conn)

   customer_id  num_payments   total
0           75            41  155.59
1          144            42  195.58
2          148            46  216.54
3          197            40  154.60
4          236            42  175.58
5          469            40  177.60
6          526            45  221.55